In [1]:
import glob
import pandas as pd
import numpy as np
import re
from geopy.geocoders import Nominatim
from geopy.exc import GeocoderUnavailable
import time
import math
from progressbar import progressbar

# Data import and primary data curation

**Author:** Tobias Schulze
**Last update:** 16 July 2023

All imported files were preprocessed to standardize file name schemes and separators.

In general, issues occurring during import and data type conversion was fixed on the fly.

Further curation will be performed after in deep evaluation of the data.

## `usagers` files
- import the files
- fix `dtype` issues on the fly
- fix an issue with the `id_vehicule` variable
- export the file to `users.csv` in `data`

### Data import and dtype issues fixing

In [2]:
# read file names
files = []
for file in glob.glob("../mar23cds_accidents_data_import/usagers*.csv"):
    files.append(file)

# import user files
users = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', index_col=0)
    if i == 0:
        users = file
    else:
        users = pd.concat([users, file], axis = 0)

# show info
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 201900000001 to 201800057783
Data columns (total 15 columns):
 #   Column       Dtype
---  ------       -----
 0   id_vehicule  object
 1   num_veh      object
 2   place        float64
 3   catu         int64
 4   grav         int64
 5   sexe         int64
 6   an_nais      float64
 7   trajet       float64
 8   secu1        float64
 9   secu2        float64
 10  secu3        float64
 11  locp         float64
 12  actp         object
 13  etatp        float64
 14  secu         float64
dtypes: float64(9), int64(3), object(3)
memory usage: 306.4+ MB

### Fixing the issue in `id_vehicule`
We have a curious encoding in `id_vehicule`.

The value `\xa0` encodes a protected blank, which cannot be removed by integrated stripping functions.
Hence, we need a lambda function to:

1. remove all non-numeric characters
2. replace empty vales by nan
3. finally, convert the variable to integer

In [3]:
# show example
users.iloc[0].id_vehicule

'138\xa0306\xa0524'

In [4]:
# remove all non-numeric characters by a regex
users['id_vehicule'] = users['id_vehicule'].apply(lambda x: re.sub('[^0-9]', '', str(x)))

# replace empty values by nan
users['id_vehicule'] = users['id_vehicule'].replace('', np.nan).astype(float)

In [5]:
# check the result
users.iloc[0].id_vehicule

138306524.0

In [6]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2509620 entries, 201900000001 to 201800057783
Data columns (total 15 columns):
 #   Column       Dtype
---  ------       -----
 0   id_vehicule  float64
 1   num_veh      object
 2   place        float64
 3   catu         int64
 4   grav         int64
 5   sexe         int64
 6   an_nais      float64
 7   trajet       float64
 8   secu1        float64
 9   secu2        float64
 10  secu3        float64
 11  locp         float64
 12  actp         object
 13  etatp        float64
 14  secu         float64
dtypes: float64(10), int64(3), object(2)
memory usage: 306.4+ MB

### Export the data

In [7]:
users.to_csv("./data/users.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

## `caracteristique` files
- import the files
- fix `dtype` issues on the fly
- fix issues with the variables `lat`, `long`, and `dep`
- export the file to `features.csv` in `data`

### Data import and dtype issues fixing

- encoding is `latin-1` to map French characters

In [8]:
# read characteristics (=features) files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/caracter*.csv"):
    files.append(file)

# import user files
features = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''], index_col=0)
    if i == 0:
        features = file
    else:
        features = pd.concat([features, file], axis = 0)

In [9]:
features.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1121571 entries, 200900000001 to 200500087954
Data columns (total 15 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   an      1121571 non-null  int64
 1   mois    1121571 non-null  int64
 2   jour    1121571 non-null  int64
 3   hrmn    1121571 non-null  object
 4   lum     1121571 non-null  int64
 5   agg     1121571 non-null  int64
 6   int     1121571 non-null  int64
 7   atm     1121498 non-null  float64
 8   col     1121552 non-null  float64
 9   com     1121569 non-null  object
 10  adr     978295 non-null   object
 11  gps     480052 non-null   object
 12  lat     634503 non-null   object
 13  long    634499 non-null   object
 14  dep     1121571 non-null  object
dtypes: float64(2), int64(6), object(7)
memory usage: 136.9+ MB

In [10]:
features.head()

,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
Num_Acc,,,,,,,,,,,,,,,
200900000001,9,1,30,2030,3,1,1,1.0,6.0,67,RTE DE GUï¿½MENï¿½,M,0.0,0,440
200900000002,9,1,17,300,3,1,1,1.0,3.0,17,LE BOIS JOLI,M,0.0,0,440
200900000003,9,1,29,645,3,1,1,1.0,3.0,52,NaN,M,0.0,0,440
200900000004,9,1,4,615,3,1,1,9.0,6.0,44,LE BECO,M,0.0,0,440
200900000005,9,1,16,1500,1,1,1,1.0,7.0,36,MOULIN DE LA GARENNE,M,0.0,0,440

In [11]:
# Pad the year to four numbers
features['an'] = [f'2{str(num).zfill(3)[-3:]}' if num < 10000 else str(num)[-4:] for num in features['an']]
features['an'] = pd.Series(features['an'], dtype='int32')

In [12]:
features.head()

,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
Num_Acc,,,,,,,,,,,,,,,
200900000001,2009,1,30,2030,3,1,1,1.0,6.0,67,RTE DE GUï¿½MENï¿½,M,0.0,0,440
200900000002,2009,1,17,300,3,1,1,1.0,3.0,17,LE BOIS JOLI,M,0.0,0,440
200900000003,2009,1,29,645,3,1,1,1.0,3.0,52,NaN,M,0.0,0,440
200900000004,2009,1,4,615,3,1,1,9.0,6.0,44,LE BECO,M,0.0,0,440
200900000005,2009,1,16,1500,1,1,1,1.0,7.0,36,MOULIN DE LA GARENNE,M,0.0,0,440

### The latitude and longitude data is formatted in two schemes:

1. decimal format with decimal separator
2. string format without decimal separator
3. NAs

The string format encodes the decimal format without decimals.
Hence, we have 3 data formats:

1. `float64`
2. `int64`
3. `NA`

In [13]:
# This part was optimised with help of ChatGPT 3.0
# remove all non-numeric characters by a regex
features['lat'] = features['lat'].apply(lambda x: re.sub('[^0-9]', '', str(x)))
features['long'] = features['long'].apply(lambda x: re.sub('[^0-9]', '', str(x)))

# split the string in two decimals before decimal separator for latitide and one in longitude
features['lat'] = features['lat'].apply(lambda x: f"{x[:2]}.{x[2:]}" if x and isinstance(x, str) else x)
features['long'] = features['long'].apply(lambda x: f"{x[:1]}.{x[1:]}" if x and isinstance(x, str) else x)

# add nan to all empty values
features['lat'] = features['lat'].replace('', np.nan).astype(float)
features['long'] = features['long'].replace('', np.nan).astype(float)

In [14]:
features.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1121571 entries, 200900000001 to 200500087954
Data columns (total 15 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   an      1121571 non-null  int32
 1   mois    1121571 non-null  int64
 2   jour    1121571 non-null  int64
 3   hrmn    1121571 non-null  object
 4   lum     1121571 non-null  int64
 5   agg     1121571 non-null  int64
 6   int     1121571 non-null  int64
 7   atm     1121498 non-null  float64
 8   col     1121552 non-null  float64
 9   com     1121569 non-null  object
 10  adr     978295 non-null   object
 11  gps     480052 non-null   object
 12  lat     634503 non-null   float64
 13  long    631290 non-null   float64
 14  dep     1121571 non-null  object
dtypes: float64(4), int32(1), int64(5), object(5)
memory usage: 132.6+ MB

In [15]:
features.head()

,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
Num_Acc,,,,,,,,,,,,,,,
200900000001,2009,1,30,2030,3,1,1,1.0,6.0,67,RTE DE GUï¿½MENï¿½,M,0.0,0.0,440
200900000002,2009,1,17,300,3,1,1,1.0,3.0,17,LE BOIS JOLI,M,0.0,0.0,440
200900000003,2009,1,29,645,3,1,1,1.0,3.0,52,NaN,M,0.0,0.0,440
200900000004,2009,1,4,615,3,1,1,9.0,6.0,44,LE BECO,M,0.0,0.0,440
200900000005,2009,1,16,1500,1,1,1,1.0,7.0,36,MOULIN DE LA GARENNE,M,0.0,0.0,440

### Remove abroad departments
[In general](https://www.map-france.com/departments), the numbers of continental departments are below 100, those of overseas are in the 900.

Hence, the departments between 100 and 900 are dummy numbers for abroad accidents.

Thus, let's remove datasets equal or greater as 100.

In [16]:
# Check dep as it should be integer
features['dep'].unique()

array([440, 750, 730, 160, 660, 220, 290, 850, 40, 270, 120, 70, 450, 80,
       480, 360, 600, 410, 280, 30, 430, 790, 680, 100, 140, 810, 50, 350,
       490, 870, 300, 830, 170, 860, 240, 540, 700, 510, 740, 460, 900,
       610, 530, 520, 210, 950, 340, 310, 560, 190, 10, 230, 840, 670,
       470, 370, 390, 640, 890, 590, 650, 380, 320, 400, 90, 150, 550,
       180, 880, 250, 570, 20, 201, 710, 330, 500, 780, 202, 770, 720,
       110, 60, 820, 800, 130, 940, 690, 260, 580, 910, 420, 920, 620,
       630, 930, 760, 971, 974, 972, 973, 976, '93', '92', '94', '87',
       '69', '38', '34', '13', '988', '976', '974', '972', '2B', '91',
       '86', '83', '80', '78', '77', '76', '72', '71', '67', '66', '64',
       '60', '51', '50', '49', '45', '37', '35', '33', '31', '30', '29',
       '22', '19', '18', '17', '74', '81', '2', '59', '95', '63', '62',
       '973', '2A', '84', '9', '73', '43', '10', '36', '16', '7', '21',
       '40', '24', '4', '85', '27', '28', '52', '68', '42', '82', '11',
       '987', '44', '61', '14', '56', '58', '54', '47', '41', '3', '75',
       '1', '57', '32', '39', '15', '23', '6', '5', '26', '48', '986',
       '971', '89', '25', '12', '88', '65', '53', '70', '46', '90', '8',
       '79', '977', '55', '978', '975'], dtype=object)

In [17]:
# It contains 2A and 2B for Corse, hence, reduce Corse to department 2
features.loc[features['dep'] == '2A', 'dep'] = 2
features.loc[features['dep'] == '2B', 'dep'] = 2
features['dep'] = features['dep'].astype(int)

In [18]:
features = features[features['dep'] < 100]
features['dep'].unique()

array([40, 70, 80, 30, 50, 10, 90, 20, 60, 93, 92, 94, 87, 69, 38, 34, 13,
        2, 91, 86, 83, 78, 77, 76, 72, 71, 67, 66, 64, 51, 49, 45, 37, 35,
       33, 31, 29, 22, 19, 18, 17, 74, 81, 59, 95, 63, 62, 84,  9, 73, 43,
       36, 16,  7, 21, 24,  4, 85, 27, 28, 52, 68, 42, 82, 11, 44, 61, 14,
       56, 58, 54, 47, 41,  3, 75,  1, 57, 32, 39, 15, 23,  6,  5, 26, 48,
       89, 25, 12, 88, 65, 53, 46,  8, 79, 55])

In [19]:
# Look in the data. Look for columns with any NaN first:
features[features.isna().any(axis=1)]

,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
Num_Acc,,,,,,,,,,,,,,,
200900001222,2009,1,12,1400,1,1,1,1.0,1.0,198,NaN,M,40.0,0.0,40
200900001223,2009,1,6,1815,3,1,1,4.0,1.0,240,NaN,M,40.0,0.0,40
200900001225,2009,1,19,1615,2,1,9,2.0,6.0,110,NaN,M,40.0,0.0,40
200900001226,2009,1,19,2035,5,2,1,1.0,2.0,112,PLAINE (BD. DE LA),NaN,NaN,NaN,40
200900001227,2009,1,23,2200,3,1,1,9.0,1.0,188,NaN,M,40.0,0.0,40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200500079965,2005,12,24,1230,1,1,9,1.0,3.0,122.0,NAYROU (RUE JEAN),NaN,NaN,NaN,90
200500079966,2005,12,2,1510,1,2,1,1.0,1.0,225.0,"00, MILLIANE ESPLANADE D",NaN,NaN,NaN,90
200500079967,2005,12,6,1055,1,2,9,2.0,2.0,225.0,"05, FOIX AVENUE DE",NaN,NaN,NaN,90
200500079968,2005,12,13,2000,5,2,1,1.0,1.0,225.0,MIREPOIX ROUTE DE,NaN,NaN,NaN,90
200500084434,2005,12,6,2140,3,1,1,2.0,7.0,249.0,A42,NaN,NaN,NaN,10

### Save to a temporary merged file
This is temporary step to keep the merge file available for the geolocation processing.

features.to_csv("./data/230801_features_merged.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

### Fill gaps in the geolocations
**Credits:** https://github.com/vaclavdekanovsky/data-analysis-in-examples/blob/master/Maps/Geocoding/Address%20to%20Location.ipynb

Get the index of location with existing addresses and no geolocation

Try to retrieve data from OpenStreetMap to fill georeference.

In the case, no data is retrieved, add nan to the georeference.

So far, the retrieval gives up as no valid return occurs. 

Some of the addresses are truncated.

We can try to fill those on a later stage.

# Get geolocation from given location or address
def get_geocode(location):
    geolocator = Nominatim(user_agent="http")
    try:
        data = geolocator.geocode(location)
        return data
    except GeocoderUnavailable: # in case of any error, return nan
        return np.nan

Loop the index entries to retrieve datea from [Nominatim](https://nominatim.org).

features.to_csv("./data/features_tmp.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

# Read stored file, if loop breaks
features = pd.read_csv("./data/230801_features_merged.csv", sep = ',', header = 0, na_values='n/a', index_col=0, low_memory=False)

# Add an additional column to log processing
# Danger: overwrites data
features['adr_retrieved'] = np.nan

# The following data is set later:
# 0: No data retrieved (not found or geolocation exists already)
# 1: Data retrieved and added to geolocation

# Adjusted query to avoid reanalysis
index = features[((features['lat'] == 0) | features['long'] == 0) | # catch all cases with 0 in lat/long
                 ((features['lat'] == 40) | features['long'] ==0) | # catch all case with 0 /40 in long/lat 
                 ((features['adr'].isnull() == False) & ((features['lat'].isnull() == True)) | features['long'].isnull() == True)
                 #((features['adr'].isnull() == False) & (features['lat']isnull() == True | features['long'].any().isnull() == True))             
                 ].index # catch all cases with nan or null in lat/long

features[features.index.isin(index)].head().sort_index(ascending = True)
                  
                  #| #  catch all cases with nan or null in lat/long
                 #(].index # catch all missconfigured case with lat = 40 and long = 0

# only for reindexing
index = features[(((features['lat'] == 0) | features['long'] == 0) & pd.isna(features['adr_retrieved'])) | # catch all cases with 0 in lat/long
                 (((features['lat'] == 40) | features['long'] ==0) & pd.isna(features['adr_retrieved'])) | # catch all case with 0 /40 in long/lat 
                 (((features['adr'].isnull() == False) & ((features['lat'].isnull() == True)) | features['long'].isnull() == True) & pd.isna(features['adr_retrieved']))
                 #((features['adr'].isnull() == False) & (features['lat']isnull() == True | features['long'].any().isnull() == True))  
                 ].index # catch all cases with nan or null in lat/long

features[features.index.isin(index)].head().sort_index(ascending = True)
                  
                  #| #  catch all cases with nan or null in lat/long
                 #(].index # catch all missconfigured case with lat = 40 and long = 0

# Danger: overwrites data
# Loop the index entries to retrieve datea from [Nominatim](https://nominatim.org/)

sleep = 2 # required to avoid ip blocking and timeout (page 502) because of too many queries
for i in progressbar(index): # show a progress bar
        features.to_csv("./data/features_tmp.csv", sep = ',', header = True, na_rep = 'n/a', index=True) # better to store temporarily
    
        if pd.isna(features.loc[[i], 'adr'].item()) == False:

            if sleep > 0:
                time.sleep(sleep) # add a sleep timer to avoid refuse errors
            location = features.loc[[i], 'adr'].values[0]
            location = location + ', France'
            data = get_geocode(location)
            if np.isnan(features.loc[[i], 'adr_retrieved'].item()):
                if pd.isna(data):
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0
                elif data == None:
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0
                elif pd.isna(features.loc[[i], 'lat'].item() == 40) & pd.isna(features.loc[[i], 'long'].item() == 0):
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0
                elif pd.isna(features.loc[[i], 'lat'].item() == 0) & pd.isna(features.loc[[i], 'long'].item() == 0):
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0
                else:
                    features.loc[[i], 'lat'] = data.point.latitude
                    features.loc[[i], 'long'] = data.point.longitude
                    features.loc[[i], 'adr_retrieved'] = 1
            else:
                features.loc[[i], 'adr_retrieved'] = 0
        elif pd.isna(features.loc[[i], 'adr'].item()) == True:
            if pd.isna(features.loc[[i], 'lat'].item()) == 40 & pd.isna(features.loc[[i], 'long'].item()) == 0:
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0
            elif pd.isna(features.loc[[i], 'lat'].item()) == 0 & pd.isna(features.loc[[i], 'long'].item()) == 0:
                    features.loc[[i], 'lat'] = np.nan
                    features.loc[[i], 'long'] = np.nan
                    features.loc[[i], 'adr_retrieved'] = 0

# Keep the file for any further processing
features.to_csv("./data/230803_features_tmp_1726.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

In [7]:
# Read the processed data
features = pd.read_csv("./data/230803_features_tmp_1726.csv", header=0, sep=',', na_values='n/a', index_col=0, low_memory=False)

### Export the data
The data is exported to `features.csv` in the `data` folder.

In [8]:
features.to_csv("./data/features.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

## `lieux` files
- import the files
- fix `dtype` issues on the fly
- fix issues with latitude and longitude
- export the file to `places.csv` in `data`

### Data import and dtype issues fixing

- encoding is `latin-1` to map Frensh characters

In [9]:
# read places files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/lieux*.csv"):
    files.append(file)

    # import user files
places = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='latin-1', na_values=['N/A', 'n/a',''], low_memory=False, index_col=0)
    if i == 0:
        places = file
    else:
        places = pd.concat([places, file], axis = 0)

In [10]:
places.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1121571 entries, 202100000001 to 200700084726
Data columns (total 18 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   catr     1121570 non-null  float64
 1   voie     1014391 non-null  object
 2   v1       485747 non-null   float64
 3   v2       51369 non-null    object
 4   circ     1119997 non-null  float64
 5   nbv      1118840 non-null  float64
 6   vosp     1118810 non-null  float64
 7   prof     1119622 non-null  float64
 8   pr       646087 non-null   object
 9   pr1      644268 non-null   object
 10  plan     1119290 non-null  float64
 11  lartpc   902739 non-null   object
 12  larrout  1008730 non-null  object
 13  surf     1119647 non-null  float64
 14  infra    1116163 non-null  float64
 15  situ     1116601 non-null  float64
 16  vma      163102 non-null   float64
 17  env1     953029 non-null   float64
dtypes: float64(12), object(6)
memory usage: 162.6+ MB

In [11]:
places.head()

,catr,voie,v1,v2,circ,nbv,vosp,prof,pr,pr1,plan,lartpc,larrout,surf,infra,situ,vma,env1
Num_Acc,,,,,,,,,,,,,,,,,,
202100000001,3.0,981,-1.0,NaN,2.0,2.0,0.0,1.0,(1),(1),1.0,NaN,-1,1.0,0.0,1.0,80.0,NaN
202100000002,3.0,20,0.0,E,2.0,2.0,0.0,1.0,0,10,1.0,NaN,-1,1.0,0.0,1.0,80.0,NaN
202100000003,4.0,GENERAL GALLIENI (BOULEVARD DU),0.0,NaN,2.0,2.0,0.0,1.0,(1),(1),1.0,NaN,-1,1.0,0.0,1.0,50.0,NaN
202100000004,3.0,GENERAL GALLIENI (BOULEVARD DU),0.0,NaN,2.0,4.0,0.0,1.0,0,1,1.0,NaN,-1,1.0,0.0,1.0,50.0,NaN
202100000005,7.0,PARIS. ROUTE DE,-1.0,NaN,2.0,2.0,-1.0,1.0,11,150,1.0,NaN,-1,1.0,0.0,1.0,50.0,NaN

### Export the data
The data is exported to `places.csv` in the `data` folder.

In [12]:
places.to_csv("./data/places.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

## `vehicules` files
- import the files
- fix `dtype` issues on the fly
- fix issues with latitude and longitude
- export the file to `vehicles.csv` in `data`

### Data import

In [13]:
# read vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/vehicules*.csv"):
    files.append(file)

# import user files
vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ',', encoding='utf-8', na_values=['N/A', 'n/a',''], low_memory=False, index_col=0)
    if i == 0:
        vehicles = file
    else:
        vehicles = pd.concat([vehicles, file], axis = 0)

In [14]:
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 200600000001 to 200900074898
Data columns (total 10 columns):
 #   Column       Dtype
---  ------       -----
 0   senc         float64
 1   catv         int64
 2   occutc       float64
 3   obs          float64
 4   obsm         float64
 5   choc         float64
 6   manv         float64
 7   num_veh      object
 8   id_vehicule  object
 9   motor        float64
dtypes: float64(7), int64(1), object(2)
memory usage: 160.7+ MB

In [15]:
vehicles.head()

,senc,catv,occutc,obs,obsm,choc,manv,num_veh,id_vehicule,motor
Num_Acc,,,,,,,,,,
200600000001,0.0,7,0.0,11.0,2.0,6.0,1.0,B01,NaN,NaN
200600000001,0.0,13,0.0,0.0,2.0,1.0,15.0,A01,NaN,NaN
200600000002,0.0,7,0.0,0.0,2.0,3.0,15.0,A01,NaN,NaN
200600000002,0.0,7,0.0,0.0,2.0,3.0,1.0,B01,NaN,NaN
200600000003,0.0,10,0.0,0.0,1.0,4.0,4.0,A01,NaN,NaN

### Fixing the issue in `id_vehicule`

In [16]:
# remove all non-numeric characters by a regex
vehicles['id_vehicule'] = vehicles['id_vehicule'].apply(lambda x: re.sub('[^0-9]', '', str(x)))

# replace empty values by nan
vehicles['id_vehicule'] = vehicles['id_vehicule'].replace('', np.nan).astype(float)

In [17]:
vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1914902 entries, 200600000001 to 200900074898
Data columns (total 10 columns):
 #   Column       Dtype
---  ------       -----
 0   senc         float64
 1   catv         int64
 2   occutc       float64
 3   obs          float64
 4   obsm         float64
 5   choc         float64
 6   manv         float64
 7   num_veh      object
 8   id_vehicule  float64
 9   motor        float64
dtypes: float64(8), int64(1), object(1)
memory usage: 160.7+ MB

### Export the data
The data is exported to `vehicles.csv` in the `data` folder.

In [18]:
vehicles.to_csv("./data/vehicles.csv", sep = ',', header = True, na_rep = 'n/a', index=True)

## `registered vehicules` files
- import the files
- fix `dtype` issues on the fly
- fix issues with latitude and longitude
- export the file to `registered_vehicles.csv` in `data`

### Data import

In [19]:
# read registered vehicle files in data directory
files = []
for file in glob.glob("../mar23cds_accidents_data_import/registered_vehicles*.csv"):
    files.append(file)

# import user files
registered_vehicles = pd.DataFrame()

for i in range(0, len(files)):
    file = pd.read_csv(files[i], sep = ';', na_values=['N/A', 'n/a',''], 
                       low_memory=False, encoding="UTF-8")
    #dtype = {'Age véhicule': 'Int64'})
    if i == 0:
        registered_vehicles = file
    else:
        registered_vehicles = pd.concat([registered_vehicles, file], axis = 0)

registered_vehicles.head()

,Id_accident,Lettre Conventionnelle Véhicule,Année,Lieu Admin Actuel - Territoire Nom,Type Accident - Libellé,CNIT,Catégorie véhicule,Age véhicule,Type Accident - Libellé (old)
0,63 387 461,A,2019,Métropole,Accident Léger,N10MCDCTPV62189,VU,3.0,NaN
1,63 387 461,B,2019,Métropole,Accident Léger,M10JT0VP015D744,VU,2.0,NaN
2,63 387 462,A,2019,Métropole,Accident grave non mortel,JS1CJ2251001004,Moto lourde,10.0,NaN
3,63 387 463,A,2019,Métropole,Accident Léger,VF7FC8HZB273438,VT,14.0,NaN
4,63 387 464,A,2019,Métropole,Accident Léger,M10NSSVP035L180,VT,1.0,NaN

In [20]:
registered_vehicles['Age véhicule'] = registered_vehicles['Age véhicule'].replace('#VALEURMULTI', np.nan).astype(float)

In [21]:
registered_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1290207 entries, 0 to 98024
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1290207 non-null  object
 1   Lettre Conventionnelle Véhicule     1290206 non-null  object
 2   Année                               1290207 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1290207 non-null  object
 4   Type Accident - Libellé             1078193 non-null  object
 5   CNIT                                845998 non-null   object
 6   Catégorie véhicule                  1290207 non-null  object
 7   Age véhicule                        1181107 non-null  float64
 8   Type Accident - Libellé (old)       212014 non-null   object
dtypes: float64(1), int64(1), object(7)
memory usage: 98.4+ MB

### Fixing the issue in `Id_accident`

In [22]:
# remove all non-numeric characters by a regex
registered_vehicles['Id_accident'] = registered_vehicles['Id_accident'].apply(lambda x: re.sub('[^0-9]', '', str(x)))

# replace empty values by nan
registered_vehicles['Id_accident'] = registered_vehicles['Id_accident'].replace('', np.nan).astype(float)

In [23]:
registered_vehicles.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1290207 entries, 0 to 98024
Data columns (total 9 columns):
 #   Column                              Non-Null Count    Dtype
---  ------                              --------------    -----
 0   Id_accident                         1290207 non-null  float64
 1   Lettre Conventionnelle Véhicule     1290206 non-null  object
 2   Année                               1290207 non-null  int64
 3   Lieu Admin Actuel - Territoire Nom  1290207 non-null  object
 4   Type Accident - Libellé             1078193 non-null  object
 5   CNIT                                845998 non-null   object
 6   Catégorie véhicule                  1290207 non-null  object
 7   Age véhicule                        1181107 non-null  float64
 8   Type Accident - Libellé (old)       212014 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 98.4+ MB

In [24]:
registered_vehicles.head()

,Id_accident,Lettre Conventionnelle Véhicule,Année,Lieu Admin Actuel - Territoire Nom,Type Accident - Libellé,CNIT,Catégorie véhicule,Age véhicule,Type Accident - Libellé (old)
0,63387461.0,A,2019,Métropole,Accident Léger,N10MCDCTPV62189,VU,3.0,NaN
1,63387461.0,B,2019,Métropole,Accident Léger,M10JT0VP015D744,VU,2.0,NaN
2,63387462.0,A,2019,Métropole,Accident grave non mortel,JS1CJ2251001004,Moto lourde,10.0,NaN
3,63387463.0,A,2019,Métropole,Accident Léger,VF7FC8HZB273438,VT,14.0,NaN
4,63387464.0,A,2019,Métropole,Accident Léger,M10NSSVP035L180,VT,1.0,NaN

### Export the data
The data is exported to `registered_vehicles.csv` in the `data` folder.

In [25]:
registered_vehicles.to_csv("./data/registered_vehicles.csv", sep = ',', header = True, na_rep = 'n/a', index=False)

In [26]:
registered_vehicles['Année'].unique()

array([2019, 2020, 2018, 2016, 2010, 2012, 2011, 2013, 2015, 2009, 2021,
       2017, 2014])

### Merge all data
- Merge all files except `registered_vehicles`.
- The variables `id_vehicule` and `num_veh` do exist in `users` and `vehicules`.
- Thus, we need to merge also by these variables to avoid the creation of cross-merged datasets.

In [27]:
# merge files
merged_df = pd.merge(users, features, on='Num_Acc', suffixes=('_users', '_features'))
merged_df = pd.merge(merged_df, places, on='Num_Acc', suffixes=('_merged_df', '_places'))
merged_df = pd.merge(merged_df, vehicles, on=['Num_Acc', 'id_vehicule', 'num_veh'])

In [43]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 473311 entries, 201900000001 to 201800049520
Data columns (total 57 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id_vehicule    347617 non-null  float64
 1   num_veh        473311 non-null  object
 2   place          466958 non-null  float64
 3   catu           473311 non-null  int64
 4   grav           473311 non-null  int64
 5   sexe           473311 non-null  int64
 6   an_nais        470232 non-null  float64
 7   trajet         473222 non-null  float64
 8   secu1          347617 non-null  float64
 9   secu2          347617 non-null  float64
 10  secu3          347617 non-null  float64
 11  locp           471118 non-null  float64
 12  actp           471113 non-null  object
 13  etatp          471109 non-null  float64
 14  secu           123160 non-null  float64
 15  an             473311 non-null  int64
 16  mois           473311 non-null  int64
 17  jour           473311 non-null  int64
 18  hrmn           473311 non-null  object
 19  lum            473311 non-null  int64
 20  agg            473311 non-null  int64
 21  int            473311 non-null  int64
 22  atm            473311 non-null  float64
 23  col            473304 non-null  float64
 24  com            473311 non-null  object
 25  adr            442233 non-null  object
 26  gps            60967 non-null   object
 27  lat            417280 non-null  float64
 28  long           417280 non-null  float64
 29  dep            473311 non-null  int64
 30  adr_retrieved  91714 non-null   float64
 31  catr           473311 non-null  float64
 32  voie           432780 non-null  object
 33  v1             374505 non-null  float64
 34  v2             30373 non-null   object
 35  circ           473019 non-null  float64
 36  nbv            472865 non-null  float64
 37  vosp           472740 non-null  float64
 38  prof           472854 non-null  float64
 39  pr             405856 non-null  object
 40  pr1            405080 non-null  object
 41  plan           472778 non-null  float64
 42  lartpc         119894 non-null  object
 43  larrout        341072 non-null  object
 44  surf           472856 non-null  float64
 45  infra          472394 non-null  float64
 46  situ           472464 non-null  float64
 47  vma            347617 non-null  float64
 48  env1           124822 non-null  float64
 49  senc           473288 non-null  float64
 50  catv           473311 non-null  int64
 51  occutc         129876 non-null  float64
 52  obs            473224 non-null  float64
 53  obsm           472884 non-null  float64
 54  choc           473291 non-null  float64
 55  manv           473296 non-null  float64
 56  motor          347617 non-null  float64
dtypes: float64(34), int64(11), object(12)
memory usage: 209.4+ MB

In [28]:
merged_df.head()

,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,secu1,secu2,...,vma,env1,senc,catv,occutc,obs,obsm,choc,manv,motor
Num_Acc,,,,,,,,,,,,,,,,,,,,,
201900000001,138306524.0,B01,2.0,2,4,2,2002.0,0.0,1.0,0.0,...,70.0,NaN,2.0,7,NaN,0.0,2.0,5.0,23.0,1.0
201900000001,138306524.0,B01,1.0,1,4,2,1993.0,5.0,1.0,0.0,...,70.0,NaN,2.0,7,NaN,0.0,2.0,5.0,23.0,1.0
201900000001,138306525.0,A01,1.0,1,1,1,1959.0,0.0,1.0,0.0,...,70.0,NaN,2.0,17,NaN,1.0,0.0,3.0,11.0,1.0
201900000002,138306523.0,A01,1.0,1,4,2,1994.0,0.0,1.0,0.0,...,70.0,NaN,1.0,7,NaN,4.0,0.0,1.0,0.0,1.0
201900000003,138306520.0,A01,1.0,1,1,1,1996.0,0.0,1.0,0.0,...,90.0,NaN,1.0,7,NaN,0.0,2.0,1.0,2.0,1.0

This looks good now.

In [29]:
merged_df.to_csv("./data/230816_merged_tables_basic_data.csv", sep = ',', header = True, na_rep = 'n/a', index=True)